---
kind: other
id: Methods.T:Autodesk.Revit.DB.ViewSheetSetting
source: html/c8aae0c0-0a72-1c75-e461-469b6df3985b.htm
---
# ViewSheetSetting Methods

Delete the current view sheet set, and make the In-Session set as the current one.